/*
Задача 1. Большое целое число BigInt

Общая информация
В этой задаче требуется реализовать большое целое число произвольной точности и набор операций над ним.
Задача
Реализовать большое целое  с заданным интерфейсом (см. раздел “Реализация”). Выбрать способ хранения и изменения размера содержимого.
Вместо malloc использовать new, вместо free использовать delete
Методы строки можно посмотреть здесь: https://en.cppreference.com/w/cpp/string/basic_string 
Тщательно задокументировать публичные члены класса на языке, приближенном к техническому английскому.
Написать юнит-тесты на все публичные методы класса с помощью любой специализированной библиотеки (рекомендуется Google Test Framework http://code.google.com/p/googletest/), либо без оной (на усмотрение преподавателя). Убедиться в полноте покрытия кода тестами (каждая строчка кода должна исполняться хотя бы одним тестом).
*/



#include <iostream>

int main()
{


	return 0;
}